---
kind: type
id: T:Autodesk.Revit.DB.Electrical.ConduitType
source: html/2ec5d411-a78b-434e-0044-be65a0b6fb69.htm
---
# Autodesk.Revit.DB.Electrical.ConduitType

This class represents a conduit type in Autodesk Revit.

## Syntax (C#)
```csharp
public class ConduitType : MEPCurveType
```